Revit 2027 API
ParameterTypeId.AnalyticalSurfaceWidth Property
 "Width"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalSurfaceWidth { get; }
Public Shared ReadOnly Property AnalyticalSurfaceWidth As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalSurfaceWidth {
	ForgeTypeId^ get ();
}
static member AnalyticalSurfaceWidth : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace